# Data Wrangling

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv("dataset\data.csv")

---
### head and tail
**head** gives the record of dataset from top.  
**tail** gives the record from bottom.

---

In [3]:
df.head()

   Unnamed: 0  Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0         0       3    male  22.0      1      0   7.2500        S
1           1         1       1  female  38.0      1      0  71.2833        C
2           2         1       3  female  26.0      0      0   7.9250        S
3           3         1       1  female  35.0      1      0  53.1000        S
4           4         0       3    male  35.0      0      0   8.0500        S

In [4]:
df.tail()

     Unnamed: 0  Survived  Pclass     Sex   Age  SibSp  Parch   Fare Embarked
886         886         0       2    male  27.0      0      0  13.00        S
887         887         1       1  female  19.0      0      0  30.00        S
888         888         0       3  female   NaN      1      2  23.45        S
889         889         1       1    male  26.0      0      0  30.00        C
890         890         0       3    male  32.0      0      0   7.75        Q

In [5]:
df['Age']=df['Age'].fillna(df['Age'].median())

---
### inplace and axis
**drop** is used to delete row or columnm.

**inplace=True** is used depending if you want to make changes to the original df or not.  
**axis=1** is used to drop the column and **axis=0** is used to drop the row.

---

In [6]:
df.drop(["Unnamed: 0"],axis=1,inplace=True) #removing "Unnamed: 0" column

In [7]:
df.drop([3],axis=0,inplace=True) #removing 3rd row

In [8]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
4         0       3    male  35.0      0      0   8.0500        S
5         0       3    male  28.0      0      0   8.4583        Q

---
### reset_index
As you can see above that after removing 3rd row the index is unordered. 
so by using **reset_index** you can order the index.

---

In [9]:
df.reset_index(drop=True,inplace=True)

In [10]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         0       3    male  35.0      0      0   8.0500        S
4         0       3    male  28.0      0      0   8.4583        Q

---
### describe
It gives the **summary** of the Data.  
As given below **(i.e. count,min,max,std,...)**

---

In [11]:
df.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  890.000000  890.000000  890.000000  890.000000  890.000000  890.000000
mean     0.383146    2.310112   29.355247    0.522472    0.382022   32.180730
std      0.486427    0.835388   13.025643    1.103247    0.806409   49.716425
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   22.000000    0.000000    0.000000    7.903100
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   35.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

---
### info
gives the information about columns of the Data **(i.e. data_type, total not-null values,...)**

---

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 890 entries, 0 to 889
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  890 non-null    int64
 1   Pclass    890 non-null    int64
 2   Sex       890 non-null    object
 3   Age       890 non-null    float64
 4   SibSp     890 non-null    int64
 5   Parch     890 non-null    int64
 6   Fare      890 non-null    float64
 7   Embarked  888 non-null    object
dtypes: float64(2), int64(4), object(2)
memory usage: 55.8+ KB

---
### pivot_table
Being able to quickly **summarize** hundreds of rows and columns can save you a lot of time and frustration.  
**pivot_table** helps you **slice, filter, and group data** at the speed of inquiry and represent the information in a visually appealing way.  

---

In [13]:
pd.pivot_table(df,index=['Sex','Embarked'],values=['Age'],aggfunc=np.mean)

                       Age
Sex    Embarked
female C         28.287671
       Q         26.763889
       S         27.754950
male   C         31.630737
       Q         29.146341
       S         29.912132

---
In above example you can see the **average age** of person from each city belonging to perticular Sex.

---

In [14]:
pd.pivot_table(df,index=['Sex','Pclass'],values=['Survived'],aggfunc=np.sum)

               Survived
Sex    Pclass
female 1             90
       2             70
       3             72
male   1             45
       2             17
       3             47

---
In above example one can easily understand that **how many person is survived** according to class.

### Aggregate functions:
**min,max.median,mean,...**

---

In [15]:
print("Min age:{0}\nMax age:{1}\nAverage_Age:{2}\nMedian_Age:{3}".format(df['Age'].min(),df['Age'].max(),round(df['Age'].mean()),df['Age'].median()))

Min age:0.42
Max age:80.0
Average_Age:29.0
Median_Age:28.0

---
### apply and lambda

**Pandas.apply** allow the users to pass a function and apply it on every single value of the Pandas series.  
It comes as a huge improvement for the pandas library as this function helps to **segregate data** according to the conditions required due to which it is efficiently used in **data science** and **machine learning**.  

**lambda** is *anonymous* function that is going to be used only once.

---

In [16]:
def word2vec(word):
    if word=="male":
        return 1
    else:
        return 0

In [17]:
df['Sex'].head()    #before applying word2vec function.

0      male
1    female
2    female
3      male
4      male
Name: Sex, dtype: object

In [18]:
df["Sex"].apply(word2vec).head()  #applied word2vec function to "Sex" column.

0    1
1    0
2    0
3    1
4    1
Name: Sex, dtype: int64

---
### apply with lambda

In [19]:
df['Age'].apply(lambda x: x+5).head()  #it'll increment every age by five year

0    27.0
1    43.0
2    31.0
3    40.0
4    33.0
Name: Age, dtype: float64

---
### filter and map with lambda

**filter:** It filter out all the elements of a sequence, for which the function returns True.  

---

In [20]:
age_forty=list(filter(lambda x:(x==40),df['Age']))   #it'll filter out person having forty years old.  
print("No of person having age is equal to forty:{}".format(len(age_forty)))

No of person having age is equal to forty:13

---
**map:**:The **map()** function in Python takes in a function and a list as argument. The function is called with a lambda function and a list and a new list is returned which contains all the lambda modified items returned by that function for each item.

---

In [21]:
double_age=list(map(lambda x:2*x,df['Age']))     #it'll map every vlaue and double it.
print(double_age[0:5])

[44.0, 76.0, 52.0, 70.0, 56.0]

---
### crosstab

Compute a simple **cross-tabulation** of two (or more) factors.  
By default computes a frequency table of the factors unless an array of values and an aggregation function are passed.

---

In [22]:
pd.crosstab(index=df['Embarked'],columns=df['Sex'])

Sex       female  male
Embarked
C             73    95
Q             36    41
S            202   441

---
Above table is example of cross-tabulation of **Sex** and **Embarked**.

---

In [23]:
pd.crosstab(index=df['Embarked'],columns=df['Sex'],values=df['Survived'],margins=True,aggfunc='sum')

Sex       female  male  All
Embarked
C             64    29   93
Q             27     3   30
S            139    77  216
All          230   109  339

---
In above **crosstab** we used value as **survived people** and aggregation function as **sum**.   
so, it'll count people belonging to perticular Sex with perticular Embarked.

---

### Pivot Table or Crosstab?

Choose how you want to **represent the data**. At bare minimum, the **pivot table**  
compares the index and yields numerical values. Additionally,  
the **crosstab** compares the index and columns which yield the count.

---

In [24]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         0       3    male  35.0      0      0   8.0500        S
4         0       3    male  28.0      0      0   8.4583        Q

---
### loc and iloc

**loc** is label-based, which means that we have to specify the name of the rows and columns that we need to filter out.

Let's extract some rows applying some condition in **loc**.

---

In [25]:
df.loc[df.Age>70]  #records of people having age greater than seventy

     Survived  Pclass   Sex   Age  SibSp  Parch     Fare Embarked
95          0       1  male  71.0      0      0  34.6542        C
115         0       3  male  70.5      0      0   7.7500        Q
492         0       1  male  71.0      0      0  49.5042        C
629         1       1  male  80.0      0      0  30.0000        S
850         0       3  male  74.0      0      0   7.7750        S

In [26]:
df.loc[(df.Age>70),['Pclass','Sex']]    #select perticular column

     Pclass   Sex
95        1  male
115       3  male
492       1  male
629       1  male
850       3  male

---
Select rows with particular indices and particular columns with **iloc**

---

In [27]:
df.iloc[[0,1,3,4],[1,3]]   #1st list is for the rows and second one is for the columns.

   Pclass   Age
0       3  22.0
1       1  38.0
3       3  35.0
4       3  28.0

In [28]:
df.iloc[1:5,3:5]   #Slice the data frame over both rows and columns

    Age  SibSp
1  38.0      1
2  26.0      0
3  35.0      0
4  28.0      0

---
### Concat
It's used to cancatenate multiple data frame having same parameters. 

---

In [29]:
df1=df.loc[2:3]      # we'll split the data frame and concatenate this using concate function
df2=df.loc[9:10]
df3=df.loc[35:36]

In [30]:
frames=[df1,df2,df3]
pd.concat(frames,ignore_index=True)

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         1       3  female  26.0      0      0   7.9250        S
1         0       3    male  35.0      0      0   8.0500        S
2         1       3  female   4.0      1      1  16.7000        S
3         1       1  female  58.0      0      0  26.5500        S
4         1       3    male  28.0      0      0   7.2292        C
5         0       3    male  21.0      0      0   8.0500        S

---
### append
we can also use **append** to concatenate dataframes.

---

In [31]:
df1.append(df2,ignore_index=True)

   Survived  Pclass     Sex   Age  SibSp  Parch    Fare Embarked
0         1       3  female  26.0      0      0   7.925        S
1         0       3    male  35.0      0      0   8.050        S
2         1       3  female   4.0      1      1  16.700        S
3         1       1  female  58.0      0      0  26.550        S

---
## Conclusion:
From this practical, I understand the importance of Data Preprocessing (Data cleaning, Data Wrangling, Dimension reduction) and how it can be useful to archive better accuracy in model.

---